---
kind: method
id: M:Autodesk.Revit.DB.IUpdater.GetChangePriority
source: html/494c6daa-617d-1bc2-b3a8-c4b817240b93.htm
---
# Autodesk.Revit.DB.IUpdater.GetChangePriority Method

Identifies the nature of the change the Updater will be performing
 Used to identify order of execution of updaters
 Called once during registration of the updater

## Syntax (C#)
```csharp
ChangePriority GetChangePriority()
```